Revit 2027 API
SpatialElementGeometryResults.GetBoundaryFaceInfo Method
 Query the spatial element boundary face information with the given face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<SpatialElementBoundarySubface> GetBoundaryFaceInfo(
	Face face
)
Public Function GetBoundaryFaceInfo (
	face As Face
) As IList(Of SpatialElementBoundarySubface)
public:
IList<SpatialElementBoundarySubface^>^ GetBoundaryFaceInfo(
	Face^ face
)
member GetBoundaryFaceInfo :
        face : Face -> IList<SpatialElementBoundarySubface>
Parameters
face Face
 The face from the spatial element's geometry.
Return Value
IList<SpatialElementBoundarySubface>
 Sub-faces related to the room bounding elements that define the spatial element face. Returns null if there is no corresponding boundary information with the given face.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SpatialElementGeometryResults Class
Autodesk.Revit.DB Namespace